iotexpert/WW101/projects/PSoC/WA101_AnalogCoProcessor/WA101_AnalogCoProcessor.cydsn/Generated_Source/PSoC4/ADC.h
/*******************************************************************************
* Function Prototypes
*******************************************************************************/
void ADC_SelectConfig(uint32 config, uint32 restart);
void ADC_InitConfig(const ADC_CONFIG_STRUCT *config);
void ADC_Init(void);
void ADC_Enable(void);

CY_ISR_PROTO(ADC_Interrupt);

/**
* \addtogroup group_general
* @{
*/
void ADC_Start(void);
void ADC_StartEx(cyisraddress address);
void ADC_Stop(void);
void ADC_StartConvert(void);
void ADC_StopConvert(void);
void ADC_SetConvertMode(uint32 mode);
void ADC_SetEosMask(uint32 mask);
uint32 ADC_IsEndConversion(uint32 retMode);
int16 ADC_GetResult16(uint32 chan);
int32 ADC_GetResult32(uint32 chan);
void ADC_SetLowLimit(uint32 lowLimit);
void ADC_SetHighLimit(uint32 highLimit);
void ADC_SetLimitMask(uint32 mask);
void ADC_SetSatMask(uint32 mask);
void ADC_SetOffset(uint32 chan, int16 offset);
void ADC_SetGain(uint32 chan, int32 adcGain);
float32 ADC_CountsTo_Volts(uint32 chan, int16 adcCounts);
int16 ADC_CountsTo_mVolts(uint32 chan, int16 adcCounts);
int32 ADC_CountsTo_uVolts(uint32 chan, int16 adcCounts);


/** @} general */

void ADC_SetChanMask(uint32 chanMask);
void ADC_SaveConfig(void);
void ADC_RestoreConfig(void);

/**
* \addtogroup group_power
* @{
*/
void ADC_Sleep(void);
void ADC_Wakeup(void);
/** @} power */
CY_ISR_PROTO( ADC_ISR );

/*******************************************************************************
*       Type defines
*******************************************************************************/


/*******************************************************************************
                                  Parameters
The parameters that are set in the customizer are redefined as constants here.
*******************************************************************************/

/*  Sample Mode setting constants */
#define ADC_TOTAL_CONFIGS                (1ul)	
/* SEY TODO: Ask HEKY who uses this parameter */
#define ADC_IRQ_REMOVE                   (0u)

/*                           Configuration 0                                  */
/******************************************************************************/
#define ADC_CFG0_SAMPLE_RATE             (1000)
#define ADC_CFG0_CHANNEL_BASE            (0u)
#define ADC_CFG0_CHANNEL_COUNT           (2u)
#define ADC_CFG0_VREF_SEL_MASK           (0x40u)
#define ADC_CFG0_NOMINAL_CLOCK_FREQ      (1000000u)
#define ADC_CFG0_CHANNEL_EN              (0x3u)
/* Sample Control Register */
#define ADC_CFG0_SUB_RESOLUTION          (0u)
#define ADC_CFG0_SINGLE_ENDED_FORMAT     (0uL)
#define ADC_CFG0_DIFFERENTIAL_FORMAT     (1uL)
#define ADC_CFG0_SAMPLES_AVERAGED        (0uL)
#define ADC_CFG0_RANGE_INTR_MASK         (0x0u)
#define ADC_CFG0_SATURATE_INTR_MASK      (0x0u)
#define ADC_CFG0_VNEG_INPUT_SEL          (7)
#define ADC_CFG0_SINGLE_PRESENT          (0)
#define ADC_CFG0_VREF_MV_VALUE           (1200)
#define ADC_CFG0_APERTURE_TIME0          (970uL)
#define ADC_CFG0_APERTURE_TIME1          (2uL)
#define ADC_CFG0_APERTURE_TIME2          (2uL)
#define ADC_CFG0_APERTURE_TIME3          (2uL)
#define ADC_CFG0_FREERUNNING             (1u)
#define ADC_CFG0_AVGERAGING_MODE         (1uL)
#define ADC_CFG0_LOW_LIMIT               (512u)
#define ADC_CFG0_HIGH_LIMIT              (3584u)
#define ADC_CFG0_RANGE_COND              (0uL)
#define ADC_CFG0_USE_SOC                 (0uL)
/* Clock parameters*/
#if (ADC_CLOCK_INTERNAL)
    #define ADC_CFG0_CLOCKDIVIDER        (((CYDEV_BCLK__HFCLK__HZ) / (ADC_CFG0_NOMINAL_CLOCK_FREQ)) - 1u)
#endif /* (ADC_CLOCK_INTERNAL) */

/* Filter Parameters */
#if(ADC_CFG0_FILTER_PRESENT == 1uL)
    /* Timing settings */
    /* Clock divider register uses 0 for a divider of 1, 1 for a divider of 2, and so on. */
    #define ADC_CFG0_FILTERCLOCKDIVIDER  (0u - 1u)
    #define ADC_CFG0_FILTERSTARTDELAY    (0u)
	/* UAB half A settings */
	/* Capacitor Values*/
	#define ADC_CFG0_HALF_A_CA_VAL       (CyUAB_cap_enum)          ()
	#define ADC_CFG0_HALF_A_CB_VAL       (CyUAB_b_cap_enum)        () /*C2 Settings */
	#define ADC_CFG0_HALF_A_CC_VAL       (CyUAB_cap_enum)          ()
	/*CF cap values are 2 though 64, so must be shifted and decremented */
	#define ADC_CFG0_HALF_A_CF_VAL       (CyUAB_f_cap_enum)        ((u >> 1u)	- 1u)

	/* Switch Settings */
	#define ADC_CFG0_HALF_A_SW_TB        (CyUAB_clk_enum)          ()
	#define ADC_CFG0_HALF_A_CB_GND       (CyUAB_gnd_unused_enum)   ()
	
	/* Capacitor Values (half B)*/
	#define ADC_CFG0_HALF_B_CA_VAL       (CyUAB_cap_enum)          ()
	#define ADC_CFG0_HALF_B_CB_VAL       (CyUAB_b_cap_enum)        () /*CPP Settings */
	#define ADC_CFG0_HALF_B_CC_VAL       (CyUAB_cap_enum)          ()	/*C1 Settings */
	/*CF cap values are 2 though 64, so must be shifted and decremented */
	#define ADC_CFG0_HALF_B_CF_VAL       (CyUAB_f_cap_enum)        ((u >> 1u)	- 1u)

	/* Switch Settings */
	#define	ADC_CFG0_HALF_B_SW_TC        (CyUAB_clk_enum)          ()
	#define ADC_CFG0_HALF_B_SW_TB        (CyUAB_clk_enum)          ()
	#define ADC_CFG0_HALF_B_CB_GND       (CyUAB_gnd_unused_enum)   ()
	#define ADC_CFG0_HALF_B_CC_GND       (CyUAB_gnd_unused_enum)   ()
#endif /* (ADC_CFG0_FILTER_PRESENT == 1) */

/*******************************************************************************
* Multiple Configuration Parameters
*******************************************************************************/

#if(ADC_TOTAL_CONFIGS > 1)
/*                           Configuration 1                                  */
/******************************************************************************/    
    #define ADC_CFG1_SAMPLE_RATE             ()
    #define ADC_CFG1_CHANNEL_BASE            (u)
    #define ADC_CFG1_CHANNEL_COUNT           (u)
    #define ADC_CFG1_VREF_SEL_MASK           (u)
    #define ADC_CFG1_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_CFG1_CHANNEL_EN              (u)
    /* Sample Control Register */
    #define ADC_CFG1_SUB_RESOLUTION          (u)
    #define ADC_CFG1_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_CFG1_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_CFG1_SAMPLES_AVERAGED        (uL)
    #define ADC_CFG1_RANGE_INTR_MASK         (u)
    #define ADC_CFG1_SATURATE_INTR_MASK      (u)
    #define ADC_CFG1_VNEG_INPUT_SEL          ()
    #define ADC_CFG1_SINGLE_PRESENT          ()
    #define ADC_CFG1_VREF_MV_VALUE           ()
    #define ADC_CFG1_APERTURE_TIME0          (uL)
    #define ADC_CFG1_APERTURE_TIME1          (uL)
    #define ADC_CFG1_APERTURE_TIME2          (uL)
    #define ADC_CFG1_APERTURE_TIME3          (uL)
    #define ADC_CFG1_FREERUNNING             (u)
    #define ADC_CFG1_AVGERAGING_MODE         (uL)
    #define ADC_CFG1_LOW_LIMIT               (u)
    #define ADC_CFG1_HIGH_LIMIT              (u)
    #define ADC_CFG1_RANGE_COND              (uL)
    #define ADC_CFG1_USE_SOC                 (0uL)
    /* Clock parameters*/
    #if (ADC_CLOCK_INTERNAL)
        #define ADC_CFG1_CLOCKDIVIDER        (((CYDEV_BCLK__HFCLK__HZ) / (ADC_CFG1_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_CLOCK_INTERNAL) */
    /* Filter Parameters */
    #if(ADC_CFG1_FILTER_PRESENT == 1)
    /* Timing settings */
       
        /* Clock divider register uses 0 for a divider of 1, 1 for a divider of 2, and so on. */
        #define ADC_CFG1_FILTERCLOCKDIVIDER  (u - 1u)
		#define ADC_CFG1_FILTERSTARTDELAY    (u)
    	/* UAB half A settings */
    	/* Capacitor Values*/
    	#define ADC_CFG1_HALF_A_CA_VAL       (CyUAB_cap_enum)          ()
    	#define ADC_CFG1_HALF_A_CB_VAL       (CyUAB_b_cap_enum)        () /*C2 Settings */
    	#define ADC_CFG1_HALF_A_CC_VAL       (CyUAB_cap_enum)          ()
	    /*CF cap values are 2 though 64, so must be shifted and decremented */
    	#define ADC_CFG1_HALF_A_CF_VAL       (CyUAB_f_cap_enum)        ((u >> 1u) - 1u)

    	/* Switch Settings */
    	#define ADC_CFG1_HALF_A_SW_TB        (CyUAB_clk_enum)          ()
    	#define ADC_CFG1_HALF_A_CB_GND       (CyUAB_gnd_unused_enum)   ()
    	
