iotexpert/WW101/projects/PSoC/WA101_AnalogCoProcessor/WA101_AnalogCoProcessor.cydsn/Generated_Source/PSoC4/ADC.h
    	/* Capacitor Values (half B)*/
    	#define ADC_CFG1_HALF_B_CA_VAL       (CyUAB_cap_enum)          ()
    	#define ADC_CFG1_HALF_B_CB_VAL       (CyUAB_b_cap_enum)        () /*CPP Settings */
    	#define ADC_CFG1_HALF_B_CC_VAL       (CyUAB_cap_enum)          ()	/*C1 Settings */
	    /*CF cap values are 2 though 64, so must be shifted and decremented */
    	#define ADC_CFG1_HALF_B_CF_VAL       (CyUAB_f_cap_enum)        ((u >> 1u) - 1u)

    	/* Switch Settings */
    	#define	ADC_CFG1_HALF_B_SW_TC        (CyUAB_clk_enum)          ()
    	#define ADC_CFG1_HALF_B_SW_TB        (CyUAB_clk_enum)          ()
    	#define ADC_CFG1_HALF_B_CB_GND       (CyUAB_gnd_unused_enum)   ()
    	#define ADC_CFG1_HALF_B_CC_GND       (CyUAB_gnd_unused_enum)   ()
    #endif /* (ADC_CFG1_FILTER_PRESENT == 1) */

#endif /* #if(ADC_TOTAL_CONFIGS > 1) */

#if(ADC_TOTAL_CONFIGS > 2)
/*                           Configuration 2                                  */
/******************************************************************************/    
    #define ADC_CFG2_SAMPLE_RATE             ()
    #define ADC_CFG2_CHANNEL_BASE            (u)
    #define ADC_CFG2_CHANNEL_COUNT           (u)
    #define ADC_CFG2_VREF_SEL_MASK           (u)
    #define ADC_CFG2_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_CFG2_CHANNEL_EN              (u)
    /* Sample Control Register */
    #define ADC_CFG2_SUB_RESOLUTION          (u)
    #define ADC_CFG2_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_CFG2_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_CFG2_SAMPLES_AVERAGED        (uL)
    #define ADC_CFG2_RANGE_INTR_MASK         (u)
    #define ADC_CFG2_SATURATE_INTR_MASK      (u)
    #define ADC_CFG2_VNEG_INPUT_SEL          ()
    #define ADC_CFG2_SINGLE_PRESENT          ()
    #define ADC_CFG2_VREF_MV_VALUE           ()
    #define ADC_CFG2_APERTURE_TIME0          (uL)
    #define ADC_CFG2_APERTURE_TIME1          (uL)
    #define ADC_CFG2_APERTURE_TIME2          (uL)
    #define ADC_CFG2_APERTURE_TIME3          (uL)
    #define ADC_CFG2_FREERUNNING             (u)
    #define ADC_CFG2_AVGERAGING_MODE         (uL)
    #define ADC_CFG2_LOW_LIMIT               (u)
    #define ADC_CFG2_HIGH_LIMIT              (u)
    #define ADC_CFG2_RANGE_COND              (uL)
    #define ADC_CFG2_USE_SOC                 (0uL)
    /* Clock parameters*/
    #if (ADC_CLOCK_INTERNAL)
        #define ADC_CFG2_CLOCKDIVIDER        (((CYDEV_BCLK__HFCLK__HZ) / (ADC_CFG2_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_CLOCK_INTERNAL) */
    /* Filter Parameters */
    #if(ADC_CFG2_FILTER_PRESENT == 1)
    /* Timing settings */
        /* Clock divider register uses 0 for a divider of 1, 1 for a divider of 2, and so on. */
        #define ADC_CFG2_FILTERCLOCKDIVIDER  (u - 1u)
        #define ADC_CFG2_FILTERSTARTDELAY    (u)
    	/* UAB half A settings */
    	/* Capacitor Values*/
    	#define ADC_CFG2_HALF_A_CA_VAL       (CyUAB_cap_enum)          ()
    	#define ADC_CFG2_HALF_A_CB_VAL       (CyUAB_b_cap_enum)        () /*C2 Settings */
    	#define ADC_CFG2_HALF_A_CC_VAL       (CyUAB_cap_enum)          ()
	    /*CF cap values are 2 though 64, so must be shifted and decremented */
    	#define ADC_CFG2_HALF_A_CF_VAL       (CyUAB_f_cap_enum)        ((u >> 1u)	- 1u)

    	/* Switch Settings */
    	#define ADC_CFG2_HALF_A_SW_TB        (CyUAB_clk_enum)          ()
    	#define ADC_CFG2_HALF_A_CB_GND       (CyUAB_gnd_unused_enum)   ()
    	
    	/* Capacitor Values (half B)*/
    	#define ADC_CFG2_HALF_B_CA_VAL       (CyUAB_cap_enum)          ()
    	#define ADC_CFG2_HALF_B_CB_VAL       (CyUAB_b_cap_enum)        () /*CPP Settings */
    	#define ADC_CFG2_HALF_B_CC_VAL       (CyUAB_cap_enum)          ()	/*C1 Settings */
	    /*CF cap values are 2 though 64, so must be shifted and decremented */
    	#define ADC_CFG2_HALF_B_CF_VAL       (CyUAB_f_cap_enum)        ((u >> 1)	- 1u)

    	/* Switch Settings */
    	#define	ADC_CFG2_HALF_B_SW_TC        (CyUAB_clk_enum)          ()
    	#define ADC_CFG2_HALF_B_SW_TB        (CyUAB_clk_enum)          ()
    	#define ADC_CFG2_HALF_B_CB_GND       (CyUAB_gnd_unused_enum)   ()
    	#define ADC_CFG2_HALF_B_CC_GND       (CyUAB_gnd_unused_enum)   ()
    #endif /* (ADC_CFG2_FILTER_PRESENT == 1) */
#endif /* (ADC_TOTAL_CONFIGS > 2) */

#if(ADC_TOTAL_CONFIGS > 3)
/*                           Configuration 3                                  */
/******************************************************************************/	
    #define ADC_CFG3_SAMPLE_RATE             ()
    #define ADC_CFG3_CHANNEL_BASE            (u)
    #define ADC_CFG3_CHANNEL_COUNT           (u)
    #define ADC_CFG3_VREF_SEL_MASK           (u)
    #define ADC_CFG3_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_CFG3_CHANNEL_EN              (u)
    /* Sample Control Register */
    #define ADC_CFG3_SUB_RESOLUTION          (u)
    #define ADC_CFG3_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_CFG3_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_CFG3_SAMPLES_AVERAGED        (uL)
    #define ADC_CFG3_RANGE_INTR_MASK         (u)
    #define ADC_CFG3_SATURATE_INTR_MASK      (u)
    #define ADC_CFG3_VNEG_INPUT_SEL          ()
    #define ADC_CFG3_SINGLE_PRESENT          ()
    #define ADC_CFG3_VREF_MV_VALUE           ()
    #define ADC_CFG3_APERTURE_TIME0          (uL)
    #define ADC_CFG3_APERTURE_TIME1          (uL)
    #define ADC_CFG3_APERTURE_TIME2          (uL)
    #define ADC_CFG3_APERTURE_TIME3          (uL)
    #define ADC_CFG3_FREERUNNING             (u)
    #define ADC_CFG3_AVGERAGING_MODE         (uL)
    #define ADC_CFG3_LOW_LIMIT               (u)
    #define ADC_CFG3_HIGH_LIMIT              (u)
    #define ADC_CFG3_RANGE_COND              (uL)
    #define ADC_CFG3_USE_SOC                 (0uL)
    /* Clock parameters*/
    #if (ADC_CLOCK_INTERNAL)
        #define ADC_CFG3_CLOCKDIVIDER        (((CYDEV_BCLK__HFCLK__HZ) / (ADC_CFG3_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_CLOCK_INTERNAL) */
    /* Filter Parameters */
    #if(ADC_CFG3_FILTER_PRESENT == 1)
    /* Timing settings */
        /* Clock divider register uses 0 for a divider of 1, 1 for a divider of 2, and so on. */
        #define ADC_CFG3_FILTERCLOCKDIVIDER  (u - 1u)
        #define ADC_CFG3_FILTERSTARTDELAY    (u)
    	/* UAB half A settings */
    	/* Capacitor Values*/
    	#define ADC_CFG3_HALF_A_CA_VAL       (CyUAB_cap_enum)          ()
    	#define ADC_CFG3_HALF_A_CB_VAL       (CyUAB_b_cap_enum)        () /*C2 Settings */
    	#define ADC_CFG3_HALF_A_CC_VAL       (CyUAB_cap_enum)          ()
	    /*CF cap values are 2 though 64, so must be shifted and decremented */
    	#define ADC_CFG3_HALF_A_CF_VAL       (CyUAB_f_cap_enum)        ((u >> 1u)	- 1u)

    	/* Switch Settings */
    	#define ADC_CFG3_HALF_A_SW_TB        (CyUAB_clk_enum)          ()
    	#define ADC_CFG3_HALF_A_CB_GND       (CyUAB_gnd_unused_enum)   ()
    	
