iotexpert/WW101/projects/PSoC/WA101_AnalogCoProcessor/WA101_AnalogCoProcessor.cydsn/Generated_Source/PSoC4/ADC.h
    	/* Capacitor Values (half B)*/
    	#define ADC_CFG3_HALF_B_CA_VAL       (CyUAB_cap_enum)          ()
    	#define ADC_CFG3_HALF_B_CB_VAL       (CyUAB_b_cap_enum)        () /*CPP Settings */
    	#define ADC_CFG3_HALF_B_CC_VAL       (CyUAB_cap_enum)          ()	/*C1 Settings */
	    /*CF cap values are 2 though 64, so must be shifted and decremented */
    	#define ADC_CFG3_HALF_B_CF_VAL       (CyUAB_f_cap_enum)        ((u >> 1u)	- 1u)

    	/* Switch Settings */
    	#define	ADC_CFG3_HALF_B_SW_TC        (CyUAB_clk_enum)          ()
    	#define ADC_CFG3_HALF_B_SW_TB        (CyUAB_clk_enum)          ()
    	#define ADC_CFG3_HALF_B_CB_GND       (CyUAB_gnd_unused_enum)   ()
    	#define ADC_CFG3_HALF_B_CC_GND       (CyUAB_gnd_unused_enum)   ()
    #endif /* (ADC_CFG3_FILTER_PRESENT == 1) */
#endif /* (ADC_TOTAL_CONFIGS > 3) */


#define ADC_DEFAULT_SAMPLE_MODE_SEL	  (0u)
#define ADC_FREERUNNING                  (1u)
#define ADC_HARDWARESOC                  (1u)

/* Constants for setting the SAR to trigger the UAB Filter */
#define ADC_SRAM_CTRL_TRIGGER            (0x3F000000u)

/** ADC_TOTAL_CHANNELS_NUM
* This constant represents the amount of input channels available for scanning.
*/
#define ADC_TOTAL_CHANNELS_NUM           (2u) 

#define ADC_MAX_CHANNELS_EN_MASK         (uint16)(0xffffu >> (16u - ADC_TOTAL_CHANNELS_NUM))

/*******************************************************************************
*    Variables with External Linkage
*******************************************************************************/
/**
* \addtogroup group_globals
* Globals are noted in the descriptions of the functions that use globals.
* They are marked with (R), (W), or (RW) noting whether the variable is read,
* write, or read/write.
* @{
*/

/** ADC_initVar
* The ADC_initVar variable is used to indicate 
* initial configuration of this component. The variable is initialized to zero and 
* set to 1 the first time ADC_Start() is called. This allows for 
* component initialization without reinitialization in all subsequent calls to the 
* ADC_Start() routine.
* 
* If reinitialization of the component is required, then the ADC_Init() function 
* can be called before the ADC_Start() or ADC_Enable() 
* functions.
*/
extern uint8 ADC_initVar;
extern uint8 ADC_selected;

/** ADC_offset
* This array calibrates the offset for each channel. It is set to 0 the first 
* time ADC_Start() is called and can be modified using 
* ADC_SetOffset(). The array affects the 
* ADC_CountsTo_Volts(), ADC_CountsTo_mVolts(), and 
* ADC_CountsTo_uVolts() functions by subtracting the given offset.
*/
extern volatile int16 ADC_offset[ADC_TOTAL_CHANNELS_NUM];

/** ADC_countsPer10Volt
* This array is used to calibrate the gain for each channel. It is calculated 
* the first time ADC_Start() is called. The value depends on 
* channel resolution and voltage reference. It can be changed using 
* ADC_SetGain().
* 
* This array affects the ADC_CountsTo_Volts(), 
* ADC_CountsTo_mVolts(), and ADC_CountsTo_uVolts() 
* functions by supplying the correct conversion between ADC counts and the 
* applied input voltage.
*/
extern volatile int32 ADC_countsPer10Volt[ADC_TOTAL_CHANNELS_NUM];   /* Gain compensation */
extern const ADC_CONFIG_STRUCT ADC_allConfigs[ADC_TOTAL_CONFIGS];
extern const uint32 CYCODE ADC_InputsPlacement[ADC_TOTAL_CHANNELS_NUM];

/** @} globals */

#define ADC_HALF_A_CC_GND			    (0)	/* Half A CC_GND is always zero */
#define ADC_SW_EXTAGND  (CyUAB_sw_id_enum) CyUAB_SW_ID(ADC_UABH_A_SW_STATIC_PTR,((uint32)ADC_UABH_A_halfuab__VAGND_SRC), CyUAB_SW_NOX)  /* static: OA+ <-> External routed agnd */ 
#define ADC_SW_EXTREFA  (CyUAB_sw_id_enum) CyUAB_SW_ID(ADC_UABH_A_SW_CA_IN0_PTR,((uint32)((uint32)ADC_UABH_A_halfuab__VREF_SRC)*ADC_UABH_A_DYNAMIC_FIELD_SIZE), CyUAB_SW_NOX) /* A in <-> External routed vref */  
#define ADC_SW_EXTREFB  (CyUAB_sw_id_enum) CyUAB_SW_ID(ADC_UABH_A_SW_CB_IN0_PTR,((uint32)((uint32)ADC_UABH_A_halfuab__VREF_SRC)*ADC_UABH_A_DYNAMIC_FIELD_SIZE ), CyUAB_SW_NOX) /* B in <-> External routed vref */

#define ADC_MAX_FREQUENCY              (18000000u)       /*18Mhz*/

#define ADC_10US_DELAY					(10u)
#define ADC_10V_COUNTS                 (10.0F)
#define ADC_10MV_COUNTS                (10000)
#define ADC_10UV_COUNTS                (10000000L)

/*******************************************************************************
*              Registers
*******************************************************************************/

#define ADC_SAR_CTRL_REG                   (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_CTRL )
#define ADC_SAR_CTRL_PTR                   ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_CTRL )

#define ADC_SAR_SAMPLE_CTRL_REG            (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_SAMPLE_CTRL )
#define ADC_SAR_SAMPLE_CTRL_PTR            ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_SAMPLE_CTRL )
    
#define ADC_SAR_SAMPLE_TIME01_REG          (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_SAMPLE_TIME01 )
#define ADC_SAR_SAMPLE_TIME01_PTR          ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_SAMPLE_TIME01 )

#define ADC_SAR_SAMPLE_TIME23_REG          (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_SAMPLE_TIME23 )
#define ADC_SAR_SAMPLE_TIME23_PTR          ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_SAMPLE_TIME23 )

#define ADC_SAR_RANGE_THRES_REG            (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_RANGE_THRES )
#define ADC_SAR_RANGE_THRES_PTR            ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_RANGE_THRES )

#define ADC_SAR_RANGE_COND_REG             (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_RANGE_COND )
#define ADC_SAR_RANGE_COND_PTR             ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_RANGE_COND )

#define ADC_SAR_CHAN_EN_REG                (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_CHAN_EN )
#define ADC_SAR_CHAN_EN_PTR                ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_CHAN_EN )

#define ADC_SAR_START_CTRL_REG             (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_START_CTRL )
#define ADC_SAR_START_CTRL_PTR             ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_START_CTRL )
/* CDT-230388: These constants are getting added to cyfitter.h */
#define ADC_SAR_DFT_CTRL_REG               (*(reg32 *) CYREG_SAR_DFT_CTRL )
#define ADC_SAR_DFT_CTRL_PTR               ( (reg32 *) CYREG_SAR_DFT_CTRL )

