iotexpert/WW101/projects/PSoC/WA101_AnalogCoProcessor/WA101_AnalogCoProcessor.cydsn/Generated_Source/PSoC4/ADC.h
#define ADC_SAR_CHAN_CONFIG_REG            (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_CHAN_CONFIG00 )
#define ADC_SAR_CHAN_CONFIG_PTR		    ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_CHAN_CONFIG00 )
#define ADC_SAR_CHAN_CONFIG_IND		    ( ADC_cy_psoc4_sar_1__SAR_CHAN_CONFIG00 )

#define ADC_SAR_CHAN_WORK_REG              (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_CHAN_WORK00 )
#define ADC_SAR_CHAN_WORK_PTR              ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_CHAN_WORK00 )

#define ADC_SAR_CHAN_RESULT_REG            (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_CHAN_RESULT0 )
#define ADC_SAR_CHAN_RESULT_PTR            ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_CHAN_RESULT0 )

#define ADC_SAR_CHAN_RESULT_IND            ( ADC_cy_psoc4_sar_1__SAR_CHAN_RESULT00 )

#define ADC_SAR_CHAN0_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT00 )
#define ADC_SAR_CHAN0_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT00 )

#define ADC_SAR_CHAN1_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT01 )
#define ADC_SAR_CHAN1_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT01 )

#define ADC_SAR_CHAN2_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT2 )
#define ADC_SAR_CHAN2_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT2 )

#define ADC_SAR_CHAN3_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT3 )
#define ADC_SAR_CHAN3_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT3 )

#define ADC_SAR_CHAN4_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT4 )
#define ADC_SAR_CHAN4_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT4 )

#define ADC_SAR_CHAN5_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT5 )
#define ADC_SAR_CHAN5_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT5 )

#define ADC_SAR_CHAN6_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT6 )
#define ADC_SAR_CHAN6_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT6 )

#define ADC_SAR_CHAN7_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT7 )
#define ADC_SAR_CHAN7_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT7 )

#define ADC_SAR_CHAN8_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT8 )
#define ADC_SAR_CHAN8_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT8 )

#define ADC_SAR_CHAN9_RESULT_REG           (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT9 )
#define ADC_SAR_CHAN9_RESULT_PTR           ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT9 )

#define ADC_SAR_CHAN10_RESULT_REG          (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT10 )
#define ADC_SAR_CHAN10_RESULT_PTR          ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT10 )

#define ADC_SAR_CHAN11_RESULT_REG          (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT11 )
#define ADC_SAR_CHAN11_RESULT_PTR          ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT11 )

#define ADC_SAR_CHAN12_RESULT_REG          (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT12 )
#define ADC_SAR_CHAN12_RESULT_PTR          ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT12 )

#define ADC_SAR_CHAN13_RESULT_REG          (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT13 )
#define ADC_SAR_CHAN13_RESULT_PTR          ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT13 )

#define ADC_SAR_CHAN14_RESULT_REG          (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT14 )
#define ADC_SAR_CHAN14_RESULT_PTR          ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT14 )

#define ADC_SAR_CHAN15_RESULT_REG          (*(reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT15 )
#define ADC_SAR_CHAN15_RESULT_PTR          ( (reg32 *) ADC_cy_psoc4_sarmux_1__SAR_CHAN_RESULT15 )
/* CDT-230483: These will be in cyfitter. */
#define ADC_SAR_CHAN_WORK_UPDATED_REG      (*(reg32 *) CYREG_SAR_CHAN_WORK_UPDATED)
#define ADC_SAR_CHAN_WORK_UPDATED_PTR      ( (reg32 *) CYREG_SAR_CHAN_WORK_UPDATED)

#define ADC_SAR_CHAN_RESULT_UPDATED_REG    ( *(reg32 *) CYREG_SAR_CHAN_RESULT_UPDATED )
#define ADC_SAR_CHAN_RESULT_UPDATED_PTR    ( (reg32 *) CYREG_SAR_CHAN_RESULT_UPDATED )

#define ADC_SAR_CHAN_WORK_NEWVALUE_REG     (*(reg32 *) CYREG_SAR_CHAN_WORK_NEWVALUE)
#define ADC_SAR_CHAN_WORK_NEWVALUE_PTR     ( (reg32 *) CYREG_SAR_CHAN_WORK_NEWVALUE)

#define ADC_SAR_CHAN_RESULT_NEWVALUE_REG   ( *(reg32 *) CYREG_SAR_CHAN_RESULT_NEWVALUE )
#define ADC_SAR_CHAN_RESULT_NEWVALUE_PTR   ( (reg32 *) CYREG_SAR_CHAN_RESULT_NEWVALUE )

#define ADC_SAR_STATUS_REG                 (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_STATUS )
#define ADC_SAR_STATUS_PTR                 ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_STATUS )

#define ADC_SAR_AVG_START_REG              (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_AVG_STAT )
#define ADC_SAR_AVG_START_PTR              ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_AVG_STAT )
    
#define ADC_SAR_INTR_REG                   (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_INTR )
#define ADC_SAR_INTR_PTR                   ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_INTR )

#define ADC_SAR_INTR_SET_REG               (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_INTR_SET )
#define ADC_SAR_INTR_SET_PTR               ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_INTR_SET )

#define ADC_SAR_INTR_MASK_REG              (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_INTR_MASK )
#define ADC_SAR_INTR_MASK_PTR              ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_INTR_MASK )

#define ADC_SAR_INTR_MASKED_REG            (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_INTR_MASKED )
#define ADC_SAR_INTR_MASKED_PTR            ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_INTR_MASKED )

#define ADC_SAR_SATURATE_INTR_REG          (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_SATURATE_INTR )
#define ADC_SAR_SATURATE_INTR_PTR          ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_SATURATE_INTR )

#define ADC_SAR_SATURATE_INTR_SET_REG      (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_SATURATE_INTR_SET )
#define ADC_SAR_SATURATE_INTR_SET_PTR      ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_SATURATE_INTR_SET )

#define ADC_SAR_SATURATE_INTR_MASK_REG     (*(reg32 *) ADC_cy_psoc4_sar_1__SAR_SATURATE_INTR_MASK )
#define ADC_SAR_SATURATE_INTR_MASK_PTR     ( (reg32 *) ADC_cy_psoc4_sar_1__SAR_SATURATE_INTR_MASK )

