iotexpert/WW101/projects/PSoC/WA101_AnalogCoProcessor/WA101_AnalogCoProcessor.cydsn/Generated_Source/PSoC4/ADC.h
    #define ADC_CFG2_SAMPLE_CTRL_INIT \
            (ADC_CFG2_SUB_RESOLUTION \
            | ADC_CFG2_SE_RESULT_FORMAT_INIT \
            | ADC_CFG2_DIFF_RESULT_FORMAT_INIT \
            | ADC_CFG2_AVG_SAMPLES_NUM_INIT \
            | ADC_CFG2_AVG_MODE_INIT \
            | ADC_CFG2_DSI_TRIGGER_LEVEL_INIT \
            | ADC_CFG2_DSI_TRIGGER_EN_INIT \
            | ADC_CFG2_UAB_SCAN_MODE_INIT \
            | ADC_CFG2_TRIGGER_OUT_INIT \
            | ADC_SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_MSK \
    )

    #define ADC_CFG2_RANGE_THRES_INIT \
            (ADC_CFG2_LOW_LIMIT \
            | (uint32)((uint32)ADC_CFG2_HIGH_LIMIT \
            << ADC_SAR_RANGE_THRES_RANGE_HIGH_SHFT))

    #define ADC_CFG2_RANGE_COND_INIT \
            (ADC_CFG2_RANGE_COND \
            << ADC_SAR_RANGE_COND_RANGE_COND_SHFT)
    /* Misc Config 
        [0] - Freerunning: Set if the sample mode is freerunning
        [1] - Filter Present: Set if the configuration uses a UAB filter
        [2] - Mux Switch 0: Set when VSSA is used for the neg input to any single-ended channel
    */
    #define ADC_CFG2_MISC_CONFIG_INIT \
            (ADC_CFG2_FREERUNNING \
            | (ADC_CFG2_FILTER_PRESENT \
            << ADC_MISC_CONFIG_FILTER_PRESENT_SHFT))
#endif /* ADC_TOTAL_CONFIGS > 2 */

/* ************************************************************************** */
/* ***********************Configuration 3 Definitions *********************** */
/* ************************************************************************** */
#if(ADC_TOTAL_CONFIGS > 3)
    #define ADC_CFG3_SAMPLE_TIME01_INIT \
            ((ADC_CFG3_APERTURE_TIME0 \
            << ADC_SAR_SAMPLE_TIME01_SAMPLE_TIME0_SHFT) \
            | (ADC_CFG3_APERTURE_TIME1 \
            << ADC_SAR_SAMPLE_TIME01_SAMPLE_TIME1_SHFT))

    #define ADC_CFG3_SAMPLE_TIME23_INIT \
            ((ADC_CFG3_APERTURE_TIME2 \
            << ADC_SAR_SAMPLE_TIME23_SAMPLE_TIME2_SHFT) \
            | (ADC_CFG3_APERTURE_TIME3 \
            << ADC_SAR_SAMPLE_TIME23_SAMPLE_TIME3_SHFT))

    /* Enable soc pin if used */
    #define ADC_CFG3_DSI_TRIGGER_EN_INIT \
            (ADC_CFG3_USE_SOC \
             << ADC_SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_SHFT)

    /* Set soc operation to edge or level based on running mode */
    #if(ADC_CFG3_FREERUNNING == ADC_FREERUNNING)
        #define ADC_CFG3_DSI_TRIGGER_LEVEL_INIT    ADC_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK                                               
    #else /* Edge trigger */
        #define ADC_CFG3_DSI_TRIGGER_LEVEL_INIT    (0u)														    
    #endif /* End ADC_CFG3_FREERUNNING == ADC_FREERUNNING */

    #if(ADC_CFG3_CHANNEL_COUNT > 1u)
        #define ADC_CFG3_NEG_OTHER                 (uint16)((uint16)ADC_cy_psoc4_sarmux_1__VNEG3 << 9u)
    #else
        #define ADC_CFG3_NEG_OTHER                 0u
    #endif /* ADC_CFG3_CHANNEL_COUNT > 1u */

    /* Set SE_NEG_INPUT  */
    #if(ADC_CFG3_VNEG_INPUT_SEL == ADC_NEG_SEL_VSSA_KELVIN)
        #define ADC_CFG3_SE_NEG_INPUT_INIT     (ADC_NEG_SEL_VSSA_KELVIN \
    															<< ADC_SAR_CTRL_NEG_SEL_SHFT )
    #elif(ADC_CFG3_VNEG_INPUT_SEL == ADC_NEG_SEL_VREF)
        #define ADC_CFG3_SE_NEG_INPUT_INIT     (ADC_NEG_SEL_VREF \
                                                                << ADC_SAR_CTRL_NEG_SEL_SHFT )
    #elif (ADC_CFG3_SINGLE_PRESENT != 0u)
        #define ADC_CFG3_SE_NEG_INPUT_INIT         ADC_CFG3_NEG_OTHER
    #else
        #define ADC_CFG3_SE_NEG_INPUT_INIT         0u
    #endif /* ADC_CFG3_VNEG_INPUT_SEL == ADC_NEG_SEL_VSSA_KELVIN */
    	
    	
    #if(ADC_CFG3_CHANNEL_COUNT > 1u)
        #define ADC_CFG3_SWITCH_CONF_INIT          0u
    #else /* Disable SAR sequencer from enabling routing switches in single channel mode */
        #define ADC_CFG3_SWITCH_CONF_INIT          ADC_SAR_CTRL_SWITCH_DISABLE_MSK
    #endif /* ADC_CFG3_CHANNEL_COUNT > 1u */

    /* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
    #if(ADC_CFG3_CHANNEL_COUNT == 1u)
        #define ADC_CFG3_HW_CTRL_NEGVREF_INIT      0u
    #else 
        #define ADC_CFG3_HW_CTRL_NEGVREF_INIT      ADC_SAR_CTRL_SAR_HW_CTRL_NEGVREF_MSK 
    #endif /* ADC_CFG3_CHANNEL_COUNT == 1u */

    #define ADC_CFG3_POWER_INIT  \
            (((ADC_CFG3_NOMINAL_CLOCK_FREQ > (ADC_MAX_FREQUENCY / 4uL)) \
    		? ADC_PWR_CTRL_VREF_NORMAL_PWR : \
            ((ADC_CFG3_NOMINAL_CLOCK_FREQ > (ADC_MAX_FREQUENCY / 8uL)) \
    		? ADC_PWR_CTRL_VREF_HALF_PWR  : \
            ADC_PWR_CTRL_VREF_QUARTER_PWR)) <<  ADC_SAR_CTRL_PWR_CTRL_VREF_SHFT)

    /* SAMPLE_CTRL initial values */
    #define ADC_CFG3_SE_RESULT_FORMAT_INIT \
            (ADC_CFG3_SINGLE_ENDED_FORMAT \
            << ADC_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_SHFT)

    #define ADC_CFG3_DIFF_RESULT_FORMAT_INIT \
            (ADC_CFG3_DIFFERENTIAL_FORMAT \
            << ADC_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_SHFT)
            
    #define ADC_CFG3_AVG_SAMPLES_NUM_INIT \
            (ADC_CFG3_SAMPLES_AVERAGED \
            << ADC_SAR_SAMPLE_CTRL_AVG_CNT_SHFT)

    /* Combination of Average Mode and Average Shift */
    #define ADC_CFG3_AVG_MODE_INIT \
            (ADC_CFG3_AVGERAGING_MODE \
            << ADC_SAR_SAMPLE_CTRL_AVG_SHIFT_SHFT)

    /* If using a filter, set TRIGGER_OUT_EN  and SCAN_MODE to scheduled*/
    #if(ADC_CFG3_FILTER_PRESENT == 1uL)
        #define ADC_CFG3_TRIGGER_OUT_INIT \
                (ADC_SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_MSK)
        #define ADC_CFG3_UAB_SCAN_MODE_INIT \
                (ADC_SAR_SAMPLE_CTRL_UAB_SCAN_MODE_MSK)
    #else
        #define ADC_CFG3_TRIGGER_OUT_INIT      (0u)
        #define ADC_CFG3_UAB_SCAN_MODE_INIT    (0u)
    #endif
    
    #define ADC_CFG3_CTRL_INIT  \
            (ADC_CFG3_VREF_SEL_MASK \
            | ADC_CFG3_POWER_INIT \
            | ADC_SAR_CTRL_REFBUF_EN_MSK \
            | ADC_SAR_CTRL_DSI_SYNC_CONFIG_MSK  \
            | ADC_CFG3_SWITCH_CONF_INIT \
            | ADC_CFG3_SE_NEG_INPUT_INIT \
            | ADC_CFG3_HW_CTRL_NEGVREF_INIT )


    #define ADC_CFG3_SAMPLE_CTRL_INIT \
            (ADC_CFG3_SUB_RESOLUTION \
            | ADC_CFG3_SE_RESULT_FORMAT_INIT \
            | ADC_CFG3_DIFF_RESULT_FORMAT_INIT \
            | ADC_CFG3_AVG_SAMPLES_NUM_INIT \
            | ADC_CFG3_AVG_MODE_INIT \
            | ADC_CFG3_DSI_TRIGGER_LEVEL_INIT \
            | ADC_CFG3_DSI_TRIGGER_EN_INIT \
            | ADC_CFG3_UAB_SCAN_MODE_INIT \
            | ADC_CFG3_TRIGGER_OUT_INIT \
            | ADC_SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_MSK \
    )

    #define ADC_CFG3_RANGE_THRES_INIT \
            (ADC_CFG3_LOW_LIMIT \
            | (uint32)((uint32)ADC_CFG3_HIGH_LIMIT \
            << ADC_SAR_RANGE_THRES_RANGE_HIGH_SHFT))

    #define ADC_CFG3_RANGE_COND_INIT \
            (ADC_CFG3_RANGE_COND \
            << ADC_SAR_RANGE_COND_RANGE_COND_SHFT)
    /* Misc Config 
        [0] - Freerunning: Set if the sample mode is freerunning
        [1] - Filter Present: Set if the configuration uses a UAB filter
    */
    #define ADC_CFG3_MISC_CONFIG_INIT \
            (ADC_CFG3_FREERUNNING \
            | (ADC_CFG3_FILTER_PRESENT \
            << ADC_MISC_CONFIG_FILTER_PRESENT_SHFT))
    
