iotexpert/WW101/projects/PSoC/WA101_AnalogCoProcessor/WA101_AnalogCoProcessor.cydsn/Generated_Source/PSoC4/ADC.h
#endif /* ADC_TOTAL_CONFIGS > 3 */

/*******************************************************************************
*       Configuration Structure Constants
*******************************************************************************/

/* Misc Config 
    [0] - Freerunning: Set if the sample mode is freerunning
    [1] - Filter Present: Set if the configuration uses a UAB filter
    [2] - Mux Switch 0: Set when VSSA is used for the neg input to any single-ended channel
*/
#define ADC_MISC_CONFIG_FREERUNNING_MSK        0x01u
#define ADC_MISC_CONFIG_FILTER_PRESENT_MSK     0x02u
#define ADC_MISC_CONFIG_FILTER_PRESENT_SHFT    0x01u
#define ADC_MISC_CONFIG_MUX_SWITCH0_MSK        0x04u
#define ADC_MISC_CONFIG_MUX_SWITCH0_SHFT   	0x02u

typedef enum
{
    LOW_PASS = 0, /**< Low pass */
    HIGH_PASS = 1, /**< High pass */
    BAND_PASS = 2, /**< Band pass */
    BAND_STOP = 3 /**< Notch */
} ADC_filter_type_enum;

/* Configuration description defines */
#define CFG0_TARGET_SPS 1000
#define CFG0_ACHIEVED_SPS 1000
#define CFG0_ADC_CLOCK_FREQ_HZ 1000000
#define CFG0_VREF_SOURCE VREFSOURCE_VBGR
#define CFG0_VREF_BYPASS False
#define CFG0_VNEG_SOURCE VNEGSOURCE_VREFSHORT
#define CFG0_SAMPLES_AVERAGED TWO_SAMPLES
#define CFG0_AVERAGING_MODE SEQUENTIAL_AVG
#define CFG0_ALT_RES EIGHT_BIT
#define CFG0_FILTER_TYPE LOW_PASS
#define CFG0_FILTER_F1_KHZ 100
#define CFG0_FILTER_F2_KHZ 300
#define CFG0_FILTER_SAMPLE_FREQ_KHZ 1000
#define CFG0_NUM_CHANNELS 2
#define CFG0_CHAN0_ENABLED True
#define CFG0_CHAN0_USE_ALT_RES False
#define CFG0_CHAN0_INPUT_MODE DIFFERENTIAL_CHAN
#define CFG0_CHAN0_USE_AVERAGING False
#define CFG0_CHAN0_MIN_ACQ_TIME_NS 194
#define CFG0_CHAN0_ACHIEVED_ACQ_TIME_NS 970000
#define CFG0_CHAN1_ENABLED True
#define CFG0_CHAN1_USE_ALT_RES False
#define CFG0_CHAN1_INPUT_MODE DIFFERENTIAL_CHAN
#define CFG0_CHAN1_USE_AVERAGING False
#define CFG0_CHAN1_MIN_ACQ_TIME_NS 194
#define CFG0_CHAN1_ACHIEVED_ACQ_TIME_NS 2000


#endif /* !defined(CY_ADC_H) */
/* [] END OF FILE */
